Autodesk.Revit.DB.Viewport.GetPositionAtViewAnchor(Autodesk.Revit.DB.ViewAnchor)
Gets the position coordinates at the ViewAnchor.
viewAnchor:
The viewAnchor at which the position is requested.
Returns:
The position at the ViewAnchor.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value of viewAnchor cannot be applied to this Viewport.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Viewport.SetViewAnchorAndPosition(Autodesk.Revit.DB.ViewAnchor,Autodesk.Revit.DB.XYZ)
Sets the ViewAnchor and position to Viewport.
viewAnchor:
The viewAnchor to be assigned.
position:
The position to be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value of viewAnchor cannot be applied to this Viewport.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Viewport.ViewAnchor
Specifies the method by which the view will be positioned on the sheet and for the case when it is swapped to another view. Default is set to ViewAnchor.ViewOrigin.
Since:
2026

Autodesk.Revit.DB.Viewport.ViewPosition
Specifies view's position. Default is set to XYZ.Zero.
Since:
2026